#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_vpc.main-vpc: Refreshing state... [id=vpc-0aac2656b8ada7d66]
aws_s3_bucket.terraform-state: Refreshing state... [id=terraform-state-management-ringberg]
aws_internet_gateway.main-gateway: Refreshing state... [id=igw-0bb29c89075157e22]
aws_subnet.main-subnet: Refreshing state... [id=subnet-07a49546f9236a0a2]
aws_security_group.todo-app-server-sg: Refreshing state... [id=sg-0c6275df5047b4d6d]
aws_route_table.main-route-table: Refreshing state... [id=rtb-0c3bf9d6b8f0947dd]
aws_instance.todo-app-server: Refreshing state... [id=i-0d17591e93b98a3db]
aws_route_table_association.main-route-table-association: Refreshing state... [id=rtbassoc-0c87da8ecaf7ba2db]
aws_s3_bucket_public_access_block.block: Refreshing state... [id=terraform-state-management-ringberg]
aws_eip.todo-app-server-ip: Refreshing state... [id=eipalloc-0065567c70431d02b]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_eip.todo-app-server-ip has changed
  ~ resource "aws_eip" "todo-app-server-ip" {
        id                   = "eipalloc-0065567c70431d02b"
      + tags                 = {}
        # (13 unchanged attributes hidden)
    }

  # aws_instance.todo-app-server has changed
  ~ resource "aws_instance" "todo-app-server" {
        id                                   = "i-0d17591e93b98a3db"
      ~ public_dns                           = "ec2-18-209-7-146.compute-1.amazonaws.com" -> "ec2-52-6-229-167.compute-1.amazonaws.com"
      ~ public_ip                            = "18.209.7.146" -> "52.6.229.167"
      ~ security_groups                      = [
          - "sg-0c6275df5047b4d6d",
        ]
        tags                                 = {
            "Name" = "TodoAppServer"
        }
        # (27 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket.terraform-state has changed
  ~ resource "aws_s3_bucket" "terraform-state" {
        id                          = "terraform-state-management-ringberg"
      + tags                        = {}
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_security_group.todo-app-server-sg has changed
  ~ resource "aws_security_group" "todo-app-server-sg" {
        id                     = "sg-0c6275df5047b4d6d"
        name                   = "todo-app-server-sg"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.main-subnet has changed
  ~ resource "aws_subnet" "main-subnet" {
        id                                             = "subnet-07a49546f9236a0a2"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.todo-app-server-ip will be updated in-place
  ~ resource "aws_eip" "todo-app-server-ip" {
        id                   = "eipalloc-0065567c70431d02b"
      ~ instance             = "i-0d17591e93b98a3db" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.todo-app-server must be replaced
-/+ resource "aws_instance" "todo-app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:816151518046:instance/i-0d17591e93b98a3db" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0d17591e93b98a3db" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0e15fb283888260c8" -> (known after apply)
      ~ private_dns                          = "ip-10-0-62-192.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.62.192" -> (known after apply)
      ~ public_dns                           = "ec2-52-6-229-167.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.6.229.167" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0c6275df5047b4d6d",
        ]
        tags                                 = {
            "Name" = "TodoAppServer"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0c6275df5047b4d6d",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0078ae4e7c420e79a" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.terraform-state,
  on main.tf line 22, in resource "aws_s3_bucket" "terraform-state":
  22: resource "aws_s3_bucket" "terraform-state" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @alexringberg, Action: `pull_request`*